## Library

In [1]:
import config
import pandas as pd
from sqlalchemy import create_engine, text

In [2]:
engine = create_engine('postgresql+psycopg2://{user}:{password}@{host}:{port}/{database}'.format(**config.connection_config))
connection = engine.connect()

## Select

In [3]:
query ="""

SELECT
  10/ 100 AS result

"""

pd.read_sql(query, con=engine)

   result
0       0

In [4]:
query ="""

SELECT
  CAST(10/ 100 AS FLOAT) AS result

"""

pd.read_sql(query, con=engine)

   result
0     0.0

In [5]:
query ="""

SELECT
  CAST(10 AS FLOAT) / CAST(100 AS FLOAT) AS result

"""

pd.read_sql(query, con=engine)

   result
0     0.1